// 更新日志内容
// 修改此文件内容，游戏中的更新日志将同步显示
window.CHANGELOG_TEXT = `
0.1.2版本更新：
1.调整超凡邪恶的强度
2.添加技能：火球
3.修复了一些ui显示bug
4.开导稀有度变为红色
5.敌人图鉴更新
6.增加了训练场
7.战斗中死亡的尸体不会再留在场上
8.将铃铛、钟表等遗物添加回来
9.添加遗物：腕豪的指虎、莫塔里的计算器
10.调整部分遗物的效果：染血的沐浴露

0.1.1版本更新：
1.更新总体ui风格
2.更改暴击音效
3.调整部分技能的数值
4.调整部分遗物的数值
5.16-30层增加了背景图和战斗背景图
6.修复了哭泣无效的bug
7.增加了闪避系统
8.修改了伏击技能的效果
9.增加了闪避动画
10.修改法术技能公式显示错误的bug
11.增加更新日志

0.1.0版本更新：
1.修复了战斗时技能信息框被角色遮挡的bug
2.修复了战斗结束技能的信息框显示不全bug
3.角色受击时增加了受击动画和特效
4.增加了怪物攻击音效和技能音效
5.战斗奖励中的跳过奖励更换为提供少量随机属性
6.提升了宠物的生存能力，现在宠物的生命值会根据关卡的推进而变高
7.鱼儿木回血的技能目标改为友方全体单位
project10

0.0.9版本更新：
1.当通过事件获得遗物/宠物时，显示获得遗物的图标以及信息
2.1-15层新增了背景图
3.修复了宠物死亡后依旧占用宠物栏的bug
4.添加事件：夺食、槟榔
5.添加商品：槟榔
6.添加遗物：和成天下、八宝粥
7.添加buff：槟榔上瘾、戒断反应
8.修复事件米奇妙妙屋选择离开时卡死的bug
9.修改了一些遗物的名称以及效果
10.修复了技能：夺食不能抢夺buff的bug
11.修复了速度腰带（现已改名为脉动）不加速度的bug
12.新增法强属性，现在开始所有法术技能伤害计算按照法强来计算
13.新增技能：肉弹冲击、疯狂乱抓、小李飞刀、盾击
14.添加护盾值属性
15.现在战斗中当前生命值不能超过最大生命值
16.技能伤害更可读
17.技能栏ui更新
`;
